app/controllers/tagged_texts_controller.rb

  def show
    @tagged_text = TaggedText.find(params[:id])
---
SELECT * FROM "tagged_texts" WHERE ("tagged_texts"."id" = 1)

  def create
    @tagged_text = TaggedText.new()
    @tagged_text.encoding = params[:tagged_text][:encoding]
    @tagged_text.format = params[:tagged_text][:format]
    @tagged_text.sentence_delimiter = params[:obt_sentence_boundary_select] || nil
    @tagged_text.uploaded_file = params[:tagged_text][:uploaded_file]
    @tagged_text.title = params[:tagged_text][:title]
    @tagged_text.comment = params[:tagged_text][:comment]

    @tagged_text.sentence_count = @tagged_text.sentences.count

    @tagged_text.save!
---
INSERT INTO "tagged_texts" ("created_at", "content_type", "updated_at", "filename", "filedata") VALUES('2009-03-09 09:18:44', NULL, '2009-03-09 09:18:44', 'test.out', '"<der>"

  def destroy
    @tagged_text = TaggedText.find(params[:id])
    @tagged_text.destroy
---
SELECT * FROM "tagged_texts" WHERE ("tagged_texts"."id" = 1)
DELETE FROM "tagged_texts" WHERE "id" = 1